In [1]:
import pandas as pd 
import numpy as np

In [4]:
df = pd.read_csv("income.csv", names=["name", "income"], skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [5]:
# using percentile to remove the outlier
# describe function give statistics from the dataframe
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [6]:
# the quantile func on a specific column give you the value for the percentile
df.income.quantile(0.75)

np.float64(7750.0)

In [7]:
percentile_99 = df.income.quantile(0.99)
percentile_99

np.float64(9400479.999999994)

In [8]:
# getting a new dataframe where the income in less than percentile 99
df_no_outilier = df[df.income<=percentile_99]
df_no_outilier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [13]:
# changing the sofia income  
df['income'][3]=np.nan

/var/folders/2y/9t5g33rn5lb2c4w3lmkt75cr0000gn/T/ipykernel_46482/2732803076.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['income'][3]=np.nan
/var/folders/2y/9t5g33rn5lb2c4w3lmkt75cr0000gn/T/ipykernel_46482/2732803076.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.nan

In [14]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [15]:
# we can use median to fill the nan value
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0